class AppStrings {
  // Onboarding strings
  static const String skip = 'تخطي';
  static const String next = 'التالي';
  static const String startNow = 'ابدأ الآن';

  static const List<String> onboardingTitles = [
    'مرحبًا في تطبيق تذكير الأذكار',
    'تذكيرات متنوعة ومخصصة',
    'تتبع وإحصائيات مفصلة',
  ];

  static const List<String> onboardingSubtitles = [
    'اختر ذكرك المفضل من مجموعة متنوعة من الأذكار والأدعية وحدد الفترة الزمنية المناسبة لك لتلقي التذكيرات بشكل منتظم طوال اليوم',
    'تصلك التذكيرات سواء كنت تستخدم الهاتف أو كان مغلقاً، مع إمكانية اختيار أصوات مختلفة لكل ذكر وتخصيص التذكير حسب رغبتك',
    'احصل على تقارير يومية وأسبوعية بعدد الأذكار التي قمت بها وتتبع تقدمك في بناء عادة الذكر اليومي مع رسوم بيانية توضيحية',
  ];
}
